const data = [
  {
    terms: 1,
    details:
      "১) মার্চেন্টকে অবশ্যই মেঘস্বর কুরিয়ার ওয়েবসাইটে প্রোডাক্ট ডেলিভারির জন্য সকল প্রকার তথ্য এবং সঠিক ওজন নির্ধারণ করে অর্ডার প্লেস/এন্ট্রি করতে হবে, ওজন ভুল দিয়ে অর্ডার প্লেস করা হলে কর্তৃপক্ষ সঠিক ওজন দিয়ে যথাযথ বিল চার্জ নির্ধারণ করার ক্ষমতা রাখে।",
  },
  {
    terms: 2,
    details: "২) মার্চেন্ট সকল প্রকার প্রোডাক্টের প্যাকেজিং এর ব্যবস্থা করবেন।",
  },
  {
    terms: 3,
    details:
      "৩) প্রোডাক্ট পিক করতে কালেক্টর পৌঁছানোর আগেই মার্চেন্টকে প্রোডাক্ট প্রস্তুত রাখতে হবে।",
  },
  {
    terms: 4,
    details:
      "৪) কোন পার্সেল মার্চেন্ট হইতে সরবরাহ করা হলেও যদি যাচাইয়ের সময় কোনও কারনে সমস্যা দেখা দেয় তবে মেঘস্বর কুরিয়ার, মার্চেন্টকে অবহিত করবে।",
  },
  {
    terms: 5,
    details:
      "৫) মার্চেন্ট যদি পার্সেল দেয় কিন্তু সফটওয়্যারে অর্ডার প্লেস/এন্ট্রি না থাকে তবে তা কোনও ভাবেই ডেলিভারি দেয়া হবে না। পণ্যটি রিসিভ হবে না এবং এই পণ্যের দায় মেঘস্বর কুরিয়ার নিবে না।",
  },
  {
    terms: 6,
    details:
      "৬) ক্রটিযুক্ত প্যাকেজিং এর কারনে প্রোডাক্ট ড্যামেজ হলে মেঘস্বর কুরিয়ার কর্তৃপক্ষ দায়ী থাকবে না।",
  },
  {
    terms: 7,
    details:
      "৭) মেঘস্বর কুরিয়ার এর মাধ্যমে মার্চেন্ট শুধুমাত্র বৈধ প্রোডাক্ট ডেলিভারি করতে পারবেন। কোন প্রকার অবৈধ প্রোডাক্ট ডেলিভারি করা যাবে না।",
  },
  {
    terms: 8,
    details:
      "৮) প্রোডাক্ট ডেলিভারী/রিটার্ন এর সময় কোন ড্যামেজ/হারিয়ে গেলে মেঘস্বর কুরিয়ার উক্ত প্রোডাক্ট মূল্যের ৬০% ক্ষতিপূরণ বহন করবে। এই অর্থ সমন্ময়ে সর্বোচ্চ তিন সপ্তাহ সময় লাগতে পারে।",
  },
  {
    terms: 9,
    details:
      "৯) সাধারণভাবে পার্সেল সংগ্রহের পরের দিন তা ডেলিভারির জন্য যাবে এবং সাধারণভাবে সংগ্রহের ৪৮ ঘন্টার মধ্যে ডেলিভারি হয়ে যাবে। পার্সেল ডেলিভারিতে যাওয়ার আগে মেঘস্বর কুরিয়ার হইতে গ্রাহককে ফোনে যোগাযোগ করা হবে। ফোনে যোগাযোগ করে না পাওয়া গেলে অথবা ঠিকানায় গিয়ে না পাওয়া গেলে মার্চেন্টকে অবহিত করা হবে। এই বিষয়ে গ্রাহকের সহিত সমস্যার সমাধান অবশ্যই মার্চেন্টকে করতে হবে।",
  },
  {
    terms: 10,
    details:
      "১০) কোন কারণে কাস্টমার প্রোডাক্ট গ্রহণ না করলে কাস্টমারকে না পাওয়া গেলে প্রোডাক্ট মার্চেন্টকে রিটার্ন করা হবে। সেক্ষেত্রে মার্চেন্ট রিটার্ন প্রোডাক্ট গ্রহণ করতে বাধ্য থাকিবে।",
  },
  {
    terms: 11,
    details:
      "১১) প্রোডাক্ট ডেলিভারি/রিটার্নের ৪৮ ঘন্টার পরে কোন ধরনের কমপ্লেইন গ্রহনযোগ্য হবে না।",
  },
  {
    terms: 12,
    details:
      "১২) পার্সেলের সহিত মূল্য সংগ্রহের শর্ত থাকলে মেঘস্বর কুরিয়ারের প্রতিনিধি তা গ্রাহকের নিকট হতে সংগ্রহ করবে। তবে মূল্য সংগ্রহের সময় সিস্টেমে/ওয়েবসাইটে অভিহিত মূল্য যা দেয়া আছে তাই সংগ্রহ করা হবে। যদি গ্রাহক ভিন্ন মূল্য পরিশোধ করতে চায় তবে মার্চেন্ট মেঘস্বর কুরিয়ারকে অবহিত করবে অথবা গ্রাহক ও মেঘস্বর কুরিয়ারের প্রতিনিধির সাথে কথা বলে তা সমাধান করবে।",
  },
  {
    terms: 13,
    details:
      "১৩) ভঙ্গুর প্রোডাক্টের ক্ষেত্রে অতিরিক্ত ৩০ টাকা চার্জ প্রযোজ্য হবে।",
  },
  {
    terms: 14,
    details:
      "১৪) অ্যাডভান্স অর্ডার এর ক্ষেত্রে মেঘস্বর কুরিয়াররের অর্ডার প্যানেলে মার্চেন্ট যে অর্ডার ডিক্লেয়ার করেছে, তার বেশি মূল্যবান এর কোন প্রোডাক্ট ডেলিভারি করার জন্য দেয়া হলে মেঘস্বর কুরিয়ার শুধুমাত্র অর্ডারের ডিক্লেয়ারকৃত প্রাইস বিবেচনায় নিবে।",
  },
  {
    terms: 15,
    details:
      "১৫) মেঘস্বর কুরিয়ার সার্ভিসের ক্ষেত্রে নিম্নে প্রদত্ত ডেলিভারি চার্জ এবং ঢাকার বাহিরে COD চার্জ ১% প্রযোজ্য হবে (সর্বনিম্ন ১০ টাকা)।",
  },
  {
    terms: 16,
    details:
      "১৬) মেঘস্বর কুরিয়ার হইতে পার্সেল বুঝে পাবার সাথে সাথে তা কুরিয়ার চার্জ যোগ্য বলে বিবেচিত হবে। সেই পার্সেল গ্রাহক নিতে অস্বীকার করলে বা মার্চেন্ট হতে মানা করা হলেও তার জন্য ডেলিভারি ফী প্রদান করতে হবে।",
  },
  {
    terms: 17,
    details:
      "১৭) প্রতি মাসের ১০ তারিখের ভেতর অবশ্যই আগের মাসের সমস্ত হিসাব মার্চেন্ট ও মেঘস্বর কুরিয়ারকে ক্লোজ করতে হবে। এরপরবর্তীতে আগের মাসের হিসাব নিয়ে আর বসা হবে না।",
  },
  {
    terms: 18,
    details:
      "১৮) মেঘস্বর কুরিয়ার যে কোন পরিস্থিতিতে চুক্তির পরিবর্তন ও পরিবর্ধনের ক্ষমতা রাখে।",
  },
];

const TermsAndConditions = () => {
  console.log(data.len);
  return (
    <div className="max-w-4xl mx-auto p-6 bg-gray-100 rounded-lg shadow-lg my-4">
      <h1 className="text-xl md:text-3xl font-bold mb-6 text-center text-gray-900">
        শর্তাবলী (Terms and Conditions)
      </h1>

      {data.map((item) => (
        <div className=" mb-2.5 flex items-start">
          <p className="text-gray-800">{item.details}</p>{" "}
        </div>
      ))}
    </div>
  );
};

export default TermsAndConditions;

